Revit 2027 API
BuiltInFailures.DPartFailures.DivisionContainsNoParts Property
 The division contains no parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DivisionContainsNoParts { get; }
Public Shared ReadOnly Property DivisionContainsNoParts As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DivisionContainsNoParts {
	FailureDefinitionId^ get ();
}
static member DivisionContainsNoParts : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace